/*Задание на создание правильных переменных
Давайте создадим несколько переменных с правильными названиями и значениями, которые будут соответствовать заданиям.

Учтите, что проверка кода в таких заданиях осуществляется автоматически, через программу. Поэтому нужно четко следовать инструкции.

При нажатии на кнопку "Посмотреть решение", программа будет проверять ваш код и полученный результат. Если все сделано правильно - вы увидите об этом сообщение. Если нет - сообщение будет содержать подсказки о том, где проблема.

Сразу познакомимся с этим интерфейсом на простых примерах и будем тренировать навык четкого выполнения задачи. Это полезно в реальной работе, когда у вас есть определенное техническое задание.

Задачи:

Создайте переменную, которая будет отображать имя пользователя. (Пользователь - user, имя - name). В неё поместите значение "John"

На следующей строке создайте переменную, отображающую номер пользователя (номер - number). В неё поместите значение 25.

Измените значение второй переменной с 25 на 24 на следующей строке.*/

const userName = "John";
let userNumber = 25;

userNumber = 24;